brew "bat"
brew "btop"
brew "fd"
brew "fzf"
brew "git"
brew "git-delta"
brew "gum"
brew "htop"
brew "jq"
brew "ngrok"
brew "neovim"
brew "ripgrep"
brew "sesh"
brew "stow"
brew "tmux"
brew "zoxide"
brew "zsh"
