aaron-bond.better-comments
adpyke.codesnap
anthropic.claude-code
asvetliakov.vscode-neovim
bierner.markdown-mermaid
bilalekrem.scenebuilderextension
bpruitt-goddard.mermaid-markdown-syntax-highlighting
chunsen.bracket-select
davidanson.vscode-markdownlint
docker.docker
donjayamanne.githistory
dotjoshjohnson.xml
eamodio.gitlens
formulahendry.code-runner
george-alisson.html-preview-vscode
github.copilot
github.copilot-chat
github.vscode-github-actions
google.geminicodeassist
gustavomarquesdemello.copy-file-syntax
james-yu.latex-workshop
jebbs.plantuml
kevinkyang.auto-comment-blocks
koehlma.markdown-math
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mikeburgh.xml-format
mindaro-dev.file-downloader
ms-azuretools.vscode-containers
ms-dotnettools.csdevkit
ms-dotnettools.csharp
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-wsl
openai.chatgpt
oracle.oracle-java
redhat.java
redhat.vscode-xml
sohibe.java-generate-setters-getters
stackbreak.comment-divider
tomoki1207.pdf
usernamehw.errorlens
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
wakatime.vscode-wakatime
yzhang.markdown-all-in-one
