tap "antoniorodr/memo"
tap "browsh-org/browsh"
tap "charmbracelet/tap"
tap "matheusml/zsh-ai"
tap "microsoft/git"
tap "opencode-ai/tap"
tap "riscv/riscv"
tap "steipete/tap"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Open source, extensible AI agent that goes beyond code suggestions
brew "block-goose-cli"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Vector graphics library with cross-device output support
brew "cairo"
# Versatile and fast Unicode/ASCII/ANSI graphics renderer
brew "chafa"
# Statistics utility to count lines of code
brew "cloc"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# OpenAI's coding agent that runs in your terminal
brew "codex"
# Get, unpack, build, and install modules from CPAN
brew "cpanminus"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# View disk space usage and delete unwanted data, fast
brew "dua-cli"
# Disk Usage/Free Utility - a better 'df' alternative
brew "duf"
# More intuitive version of du in rust
brew "dust"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Command-line fuzzy finder written in Go
brew "fzf"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Interact with Google Gemini AI models from the command-line
brew "gemini-cli"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Reformats Java source code to comply with Google Java Style
brew "google-java-format"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Java language specific implementation of the Language Server Protocol
brew "jdtls"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# LLVM's OpenMP runtime library
brew "libomp"
# CLI for SQLite Databases with auto-completion and syntax highlighting
brew "litecli"
# LLM inference in C/C++
brew "llama.cpp"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Java-based project management
brew "maven"
# Interactive cheatsheet tool for the command-line
brew "navi"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node@22"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# General-purpose speech recognition model
brew "openai-whisper"
# AI coding agent, built for the terminal
brew "opencode"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Python version management
brew "pyenv"
# Static type checker for Python
brew "pyright"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Generic machine emulator and virtualizer
brew "qemu"
# Cross-platform application and UI framework
brew "qt"
# GNU compiler collection for riscv64-elf
brew "riscv64-elf-gcc"
# Unsupervised text tokenizer and detokenizer
brew "sentencepiece"
# Strong open-source chess engine
brew "stockfish"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# CI-Friendly tool to document a database
brew "tbls"
# User interface to the TELNET protocol
brew "telnet"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal image and video viewer
brew "timg"
# Simplified and community-driven man pages
brew "tldr"
# Program that allows you to count code, quickly
brew "tokei"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Next generation frontend tooling. It's fast!
brew "vite"
# Internet file retriever
brew "wget"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Framework for Verilog RTL synthesis
brew "yosys"
# Feature-rich command-line audio/video downloader
brew "yt-dlp"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Additional completion definitions for zsh
brew "zsh-completions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# CLI app to manage your Apple Notes and Apple reminders
brew "antoniorodr/memo/memo"
# The modern, text-based browser
brew "browsh-org/browsh/browsh"
# A powerful terminal-based AI assistant for developers, providing intelligent coding assistance directly in your terminal.
brew "charmbracelet/tap/crush"
# Lightweight AI assistant for your terminal
brew "matheusml/zsh-ai/zsh-ai"
# RISC-V toolchain including gcc (with newlib), simulator (spike), and pk
brew "riscv/riscv/riscv-tools"
# Grep the GIF. Stick the landing
brew "steipete/tap/gifgrep"
# Send and read iMessage / SMS from the terminal
brew "steipete/tap/imsg"
# Fast CLI for Apple Reminders
brew "steipete/tap/remindctl"
# Link → clean text → summary
brew "steipete/tap/summarize"
# Enable Windows-like alt-tab
cask "alt-tab"
# Memory training application
cask "anki"
# Multi-track audio editor and recorder
cask "audacity"
# Display management tool
cask "betterdisplay"
# Open source, extensible AI agent that goes beyond code suggestions
cask "block-goose"
# Design and communication tool
cask "brilliant"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Write, edit, and chat about your code with AI
cask "cursor"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-meslo-lg-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Free and open-source image editor
cask "gimp"
# Cross-platform Git credential storage for multiple hosting providers
cask "git-credential-manager"
# Desktop client for GitHub repositories
cask "github"
# Utility to hide menu bar items
cask "hiddenbar"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Keyboard customiser
cask "karabiner-elements"
# Use Vim in input fields and non input fields
cask "kindavim"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Utility to extend trackpad functionality
cask "middleclick"
# App to write, plan, collaborate, and get organised
cask "notion"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Scroll with the keyboard using Vim motions
cask "scrolla"
# App that enables mouse-free UI interaction
cask "shortcat"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"
# System monitor for the menu bar
cask "stats"
# JDK from the Eclipse Foundation (Adoptium)
cask "temurin@21"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Click and more on UI Elements through typing
cask "wooshy"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "anthropic.claude-code"
vscode "asvetliakov.vscode-neovim"
vscode "bierner.markdown-mermaid"
vscode "bilalekrem.scenebuilderextension"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "chunsen.bracket-select"
vscode "davidanson.vscode-markdownlint"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "formulahendry.code-runner"
vscode "george-alisson.html-preview-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "google.geminicodeassist"
vscode "gustavomarquesdemello.copy-file-syntax"
vscode "james-yu.latex-workshop"
vscode "jebbs.plantuml"
vscode "kevinkyang.auto-comment-blocks"
vscode "koehlma.markdown-math"
vscode "llvm-vs-code-extensions.vscode-clangd"
vscode "mechatroner.rainbow-csv"
vscode "mikeburgh.xml-format"
vscode "mindaro-dev.file-downloader"
vscode "ms-azuretools.vscode-containers"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-wsl"
vscode "openai.chatgpt"
vscode "oracle.oracle-java"
vscode "redhat.java"
vscode "redhat.vscode-xml"
vscode "sohibe.java-generate-setters-getters"
vscode "stackbreak.comment-divider"
vscode "tomoki1207.pdf"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "wakatime.vscode-wakatime"
vscode "yzhang.markdown-all-in-one"
go "github.com/sqls-server/sqls"
cargo "auox"
