aaron-bond.better-comments
adpyke.codesnap
anysphere.cpptools
anysphere.cursorpyright
asvetliakov.vscode-neovim
bierner.markdown-mermaid
bpruitt-goddard.mermaid-markdown-syntax-highlighting
bradlc.vscode-tailwindcss
chunsen.bracket-select
cl.eide
cschlosser.doxdocgen
dbaeumer.vscode-eslint
docker.docker
donjayamanne.githistory
eamodio.gitlens
esbenp.prettier-vscode
formulahendry.code-runner
github.vscode-github-actions
google.geminicodeassist
huacat.office-theme
ibm.output-colorizer
idleberg.applescript
idleberg.jxa
james-yu.latex-workshop
jebbs.plantuml
kevinkyang.auto-comment-blocks
kilocode.kilo-code
koehlma.markdown-math
llvm-vs-code-extensions.vscode-clangd
mechatroner.rainbow-csv
mindaro-dev.file-downloader
ms-azuretools.vscode-containers
ms-dotnettools.vscode-dotnet-runtime
ms-python.black-formatter
ms-python.debugpy
ms-python.python
ms-toolsai.jupyter
ms-toolsai.jupyter-keymap
ms-toolsai.jupyter-renderers
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
ms-vscode-remote.remote-containers
ms-vscode.cmake-tools
ms-vscode.cpptools-themes
ms-vscode.hexeditor
ms-vscode.makefile-tools
ms-vscode.vscode-typescript-next
mshr-h.veriloghdl
naumovs.color-highlight
openai.chatgpt
oracle.oracle-java
qwtel.sqlite-viewer
redhat.java
redhat.vscode-yaml
rooveterinaryinc.roo-cline
rust-lang.rust-analyzer
saoudrizwan.claude-dev
sumneko.lua
sunshaoce.risc-v
tamasfe.even-better-toml
tomoki1207.pdf
usernamehw.errorlens
vadimcn.vscode-lldb
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscodevim.vim
vue.volar
wakatime.vscode-wakatime
yzhang.markdown-all-in-one
zixuanwang.linkerscript
